"use strict";
  
  /*===================================================================================*/
 /*                   					 M O D E L 				    				  */
/*===================================================================================*/
		function Tclock() {
			
  			var myView = null;
  			
/*-----------------------------------
	МЕТОД ИНИЦИАЛИЗАЦИИ MODEL
-----------------------------------*/
       		this.init = function(view) {	
           		myView = view;
           	}
/*-----------------------------------
	МЕТОД ОТРИСОВКИ СТРЕЛОК И 
	ПОЗИЦИОНИРОВАНИЕ В ЦЕНТРЕ
-----------------------------------*/
			this.handPosition = function (hand) {
				hand.style.bottom = 140 + 'px';
				hand.style.left = 150 - parseInt(hand.offsetWidth)/2 + 'px' ;
			}

			this.startClock = function () {	
			// ----------------------- Устанавливаем интервал в 1000 сек
					
					this.begin = setInterval(myView.updateTime,100);
				}
		}